import type { Scenario } from '../types/models'

export const scenarios: Scenario[] = [
    {
        id: 1,
        role: 'schoolboy',
        level: 1,
        situation: 'В игровом чате незнакомец отправил сообщение: "Привет! Можешь скинуть свой номер телефона? Я подарю тебе скин". Что делать?',
        variants: [
            { text: 'Скинуть номер', correct: false, explanation: 'Никогда не отправляй свои личные данные незнакомцам.' },
            { text: 'Заблокировать пользователя и отправить жалобу', correct: true, explanation: 'Верно! Мошенник может получить доступ к твоему аккаунту.' },
            { text: 'Спросить у незнакомца ник', correct: false, explanation: 'Ник ничего не даст. Мошенник заведет новый аккаунт. Лучше его заблокировать.' },

        ]
    },
    {
        id: 2,
        role: 'student',
        level: 1,
        situation: 'На почту пришло письмо, в котором представляются от имени университета: "Ваш аккаунт будет удален. Перейдите по ссылке и подтвердите данные." Что в данной ситуации делать?',
        variants: [
            { text: 'Перейти по ссылке', correct: false, explanation: 'Это обман. Университет никогда не просит подтверждения данных по ссылке из письма.' },
            { text: 'Проверить адрес отправителя', correct: true, explanation: 'Верно! Университет использует почту с собственным доменом.' },
            { text: 'Удалить письмо', correct: false, explanation: 'Ты не стал жертвой мошенника, но другие могут. Поэтому лучше сообщить в поддержку ВУЗа, чтобы они были проинформированы.' },
        ]
    },
    {
        id: 3,
        role: 'senior',
        level: 1,
        situation: 'Вам звонит якобы сотрудник банка: "Ваша карта заблокирована. Назовите код из смс". Что делать?',
        variants: [
            { text: 'Назвать код', correct: false, explanation: 'Банк никогда не спрашивает код из смс. Это делают только мошенники.' },
            { text: 'Положить трубку и позвонить в банк', correct: true, explanation: 'Верно! Свяжитесь с банком по официальному номеру, указанному на карте, либо на сайте.' },
            { text: 'Записать номер и перезвонить по нему', correct: false, explanation: 'Никогда не перезванивайте на незнакомые номера, так как они принадлежат мошенникам.' }
        ]
    }
]